DataProcessors/АРМРаботникОхраны_АвтоКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМРаботникОхраны_АвтоКомпании</Name>
			<Comment>АРМРаботник охраны Пост 1 для учета Автомобилей Компании</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/АвтоКомпанииНаТерритории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АвтоКомпанииНаТерритории</Name>
			<Comment>Автомобили компании на территории</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВъездаВыезда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВъездВыездАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВъездВыездАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВъездВыездАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвтоНаТерритории</xr:Item>
				<xr:Item>AccumulationRegister.АвтоКомпанииНаТерритории</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АРМРаботникОхраны_АвтоКомпании/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекущееВремяВъезда(Команда)
	Объект.ДатаВремяВъезда=ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ТекущееВремяВыезда(Команда)
	Объект.ДатаВремяВыезда=ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура Въезд(Команда)
	
	ВъездСЕРВЕР();
	Элементы.АвтоНаТерритории.Обновить();
	
КонецПроцедуры

 &НаСервере
Процедура  ВъездСЕРВЕР()
	
	//Проверяем Водителя - возможно уже въезжал
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоКомпанииНаТерриторииОстатки.Водитель,
		|	АвтоКомпанииНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток
		|ИЗ
		|	РегистрНакопления.АвтоКомпанииНаТерритории.Остатки(, Водитель = &Водитель) КАК АвтоКомпанииНаТерриторииОстатки
		|ГДЕ
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Водитель", Объект.Водитель);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщить("ОШИБКА!!! "+Строка(Объект.Водитель)+" уже на территории склада " );
		Возврат;
	КонецЕсли;

	
	
	//Проверка на заполнение полей
	Если  Не ЗначениеЗаполнено(Объект.Водитель) Или
		Не ЗначениеЗаполнено(Объект.ДатаВремяВъезда) Или
		Не ЗначениеЗаполнено(Объект.ПостОхраны) Или
		Не ЗначениеЗаполнено(Объект.РаботникОхраны)  Тогда
		
		Сообщить("ОШИБКА!!! Проверьте необходимые поля(помечены красным)");
		Возврат;
	КонецЕсли;
		
	
	//Если все нормально то создаем документ
	Док=Документы.ВъездВыездАвтомобилей.СоздатьДокумент();
	Док.Дата=ТекущаяДата();
	Док.ДатаВремяВъезда=Объект.ДатаВремяВъезда;
	Док.Водитель=Объект.Водитель;
	Док.Кому=Объект.Кому;
	Док.Автомобиль=Объект.Автомобиль;
	Док.ПостОхраны=Объект.ПостОхраны;
	Док.РаботникОхраны=Объект.РаботникОхраны;
	Док.ЦельВизита=Объект.ЦельВизита;
	Док.Примечание=Объект.Примечание;
	//Для Самовывоза
	Док.МаркаАвтомобиля = Объект.МаркаАвтомобиля;
	Док.НомерАвтомобиля = Объект.НомерАвтомобиля;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("ОК! Создан документ-"+Док);
КонецПроцедуры


&НаКлиенте
Процедура Выезд(Команда)
	ВыездСЕРВЕР();
	Элементы.АвтоНаТерритории.Обновить();
   	
КонецПроцедуры
 
&НаСервере
Процедура ВыездСЕРВЕР()
	  //Проверяем Водителя - может он НЕ на территории
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоКомпанииНаТерриторииОстатки.Водитель,
		|	АвтоКомпанииНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток
		|ИЗ
		|	РегистрНакопления.АвтоКомпанииНаТерритории.Остатки(, Водитель = &Водитель) КАК АвтоКомпанииНаТерриторииОстатки
		|ГДЕ
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Водитель", Объект.Водитель);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщить("ОШИБКА!!!" +Строка(Объект.Водитель)+" не въезжал на территорию склада." );
		Возврат;
	КонецЕсли;

	
	
	//Проверка на заполнение полей
	Если  Не ЗначениеЗаполнено(Объект.Водитель) Или
		Не ЗначениеЗаполнено(Объект.ДатаВремяВъезда) Или
		Не ЗначениеЗаполнено(Объект.ПостОхраны) Или
		Не ЗначениеЗаполнено(Объект.РаботникОхраны) 
		 Тогда
		
		Сообщить("ОШИБКА!!! Проверьте необходимые поля(помечены красным)");
		Возврат;
	КонецЕсли;
	
	//Проверка на заполнение времени выезда
	Если  Не ЗначениеЗаполнено(Объект.ДатаВремяВыезда) Тогда
		Сообщить("ОШИБКА!!! Заполните время выезда");
		Возврат;
	КонецЕсли;
    //Проверка на правильность времен
	//Если  Объект.ДатаВремяВъезда>Объект.ДатаВремяВыезда Тогда
	//	Сообщить("ОШИБКА!!! Время выезда не может быть меньше времени въезда!");
	//	Возврат;	
	//КонецЕсли;
	
	  //Проверка на заполнение Кол Мест
	//Если  Не ЗначениеЗаполнено(Объект.КоличествоМест) Тогда
	//	Сообщить("ОШИБКА!!! Заполните КоличествоМест");
	//	Возврат;
	//КонецЕсли;
 	
	//Если все нормально то изменяем документ
	Док=ВыборкаДетальныеЗаписи.ДокументВъездаВыезда.ПолучитьОбъект();
	Док.Дата=ТекущаяДата();
	Док.ДатаВремяВъезда=Объект.ДатаВремяВъезда;
	Док.ДатаВремяВыезда=Объект.ДатаВремяВыезда;
	Док.Водитель=Объект.Водитель;
	Док.Кому=Объект.Кому;
	Док.КоличествоМест=Объект.КоличествоМест;
	Док.ПостОхраны=Объект.ПостОхраны;
	Док.РаботникОхраны=Объект.РаботникОхраны;
	Док.ЦельВизита=Объект.ЦельВизита;
	Док.Примечание=Объект.Примечание;
	 //Для Самовывоза
	Док.МаркаАвтомобиля = Объект.МаркаАвтомобиля;
	Док.НомерАвтомобиля = Объект.НомерАвтомобиля;

	
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("ОК! Изменен -"+Док);

	
	
КонецПроцедуры


&НаСервере
Функция ПроверитьВодителяСЕРВЕР()
	 //Проверяем Водителя 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоКомпанииНаТерриторииОстатки.Водитель,
		|	АвтоКомпанииНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток
		|ИЗ
		|	РегистрНакопления.АвтоКомпанииНаТерритории.Остатки(, Водитель = &Водитель) КАК АвтоКомпанииНаТерриторииОстатки
		|ГДЕ
		|	АвтоКомпанииНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Водитель", Объект.Водитель);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//Заполняем поля от документа
		Док= ВыборкаДетальныеЗаписи.ДокументВъездаВыезда;
		
		
		Объект.ДатаВремяВъезда=Док.ДатаВремяВъезда;
		Объект.ДатаВремяВыезда=Док.ДатаВремяВыезда;
		Объект.Водитель=Док.Водитель;
		Объект.Кому=Док.Кому;
		Объект.Автомобиль=Док.Автомобиль;
		Объект.КоличествоМест=Док.КоличествоМест;
		Объект.ПостОхраны=Док.ПостОхраны;
		Объект.РаботникОхраны=Док.РаботникОхраны;
		Объект.ЦельВизита=Док.ЦельВизита;
		Объект.Примечание=Док.Примечание;
		 //Самовывоз
		Объект.МаркаАвтомобиля=Док.МаркаАвтомобиля;
		Объект.НомерАвтомобиля=Док.НомерАвтомобиля;
        //Путевой Лист  Для Водителя.
		Если Объект.Водитель.Наименование<>"1. ВОДИТЕЛЬ  САМОВЫВОЗ" Тогда
			поискПутевогоЛиста=модСерверПолныеПрава.НайтиПутевойЛист_2(Объект.Водитель,НачалоДня(ТекущаяДата()) );
			Если поискПутевогоЛиста<>Неопределено Тогда
				Объект.КоличествоМест=поискПутевогоЛиста.КоличествоМест;
			КонецЕсли;
		КонецЕсли;
		Сообщить(Строка(Объект.Водитель)+" сейчас на территории склада." );
		
		Возврат Истина;
	Иначе
		//Очищаем поля
		Объект.ДатаВремяВъезда="";
		Объект.ДатаВремяВыезда="";
		Объект.Кому="";
		Объект.МаркаАвтомобиля="";
		Объект.НомерАвтомобиля="";
		Объект.ЦельВизита="";
		Объект.Примечание="";
		
		//Объект.Водитель="";
		Объект.Автомобиль="";
		Объект.КоличествоМест="";
		
		Возврат Ложь; 
	КонецЕсли;

	
КонецФункции


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		
		//Проверка заполнен ли Пост
		Если Не ЗначениеЗаполнено(Объект.ПостОхраны) Тогда
			Сообщить("Не выбран ПОСТ ОХРАНЫ.");
			Возврат;	
		КонецЕсли;
		
		ШКВодитель=Данные;
		  //Проверка на ШК Водителя
		  		  
		  ПоискВодитель=НайтиФизЛицоПоШк(ШКВодитель,"Водитель");
		  Если ПоискВодитель<>Неопределено Тогда
			    ОчиститьСообщения();
			  	Объект.Водитель=ПоискВодитель;
				ВодительПриИзменении(Элементы.Водитель);
			 Иначе
				 Сообщить("Водитель с таким ШК не найден");
			КонецЕсли;
		  
	КонецЕсли;
	
КонецПроцедуры

 
&НаКлиенте
  Процедура ВодительПриИзменении(Элемент)
	   
	   Результат= ПроверитьВодителяСЕРВЕР();

	
	//Если Результат Тогда
	//	Элементы.Въезд.Доступность=Ложь;
	//	Элементы.Выезд.Доступность=Истина;
	//Иначе
	//	Элементы.Въезд.Доступность=Истина;
	//	Элементы.Выезд.Доступность=Ложь;
	//КонецЕсли;

   КонецПроцедуры

   
   &НаСервере
Функция НайтиФизЛицоПоШк(ШКФизЛицо,Должность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Штрихкод = &Штрихкод
	|	И ФизическиеЛица.Должность В(&Должность)";
	
	Запрос.УстановитьПараметр("Штрихкод", ШКФизЛицо);
	
	Должности=Новый Массив;
	Если Должность="Водитель" Тогда
		Должности.Добавить(Справочники.Должности.Водитель);
		Должности.Добавить(Справочники.Должности.Филиал);
	ИначеЕсли Должность="РаботникОхраны" Тогда
		Должности.Добавить(Справочники.Должности.РаботникОхраны);
	КонецЕсли;
	Запрос.УстановитьПараметр("Должность", Должности);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции

&НаСервере
   Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   Если ИмяПользователя()="ОхранаПост1" Тогда
		Объект.ПостОхраны=Справочники.ПостыОхраны.НайтиПоКоду("01");   
	   КонецЕсли;
	   
	   Если ИмяПользователя()="ОхранаПост4" Тогда
		Объект.ПостОхраны=Справочники.ПостыОхраны.НайтиПоКоду("04");   
	   КонецЕсли;
	   
	   
   КонецПроцедуры

&НаКлиенте
   Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	  Элементы.АвтоНаТерритории.Обновить();
	  Элементы.ДвиженияАвто.Обновить();
   КонецПроцедуры
